### YamlMime:PowerShellCmdlet1
uid: Az.SecurityInsights.Get-AzSentinelEntityQuery
name: Get-AzSentinelEntityQuery
module: Az.SecurityInsights
isPreview: false
summary: |-
  Gets an entity query.
description: |-
  Gets an entity query.
parameters:
  cmdletParameters:
  - name: DefaultProfile
    type: <xref href="System.Management.Automation.PSObject" data-throw-if-not-resolved="False" />
    description: |-
      The DefaultProfile parameter is not functional.
      Use the SubscriptionId parameter when available if executing the cmdlet against a different subscription.
    aliases:
    - AzureRMContext
    - AzureCredential
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: (All)
      position: Named
      isRequired: false
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: Id
    type: <xref href="System.String" data-throw-if-not-resolved="False" />
    description: |-
      entity query ID
    aliases:
    - EntityQueryId
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: Get
      position: Named
      isRequired: true
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: InputObject
    type: <xref href="Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.ISecurityInsightsIdentity" data-throw-if-not-resolved="False" />
    description: |-
      Identity Parameter
      To construct, see NOTES section for INPUTOBJECT properties and create a hash table.
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: GetViaIdentity
      position: Named
      isRequired: true
      valueFromPipeline: true
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: Kind
    type: <xref href="System.String" data-throw-if-not-resolved="False" />
    description: |-
      The entity query kind we want to fetch
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: List
      position: Named
      isRequired: false
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: ResourceGroupName
    type: <xref href="System.String" data-throw-if-not-resolved="False" />
    description: |-
      The name of the resource group.
      The name is case insensitive.
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: List
      position: Named
      isRequired: true
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    - name: Get
      position: Named
      isRequired: true
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: SubscriptionId
    type: <xref href="System.String" data-throw-if-not-resolved="False" /><span>[</span><span>]</span>
    description: |-
      The ID of the target subscription.
    defaultValue: (Get-AzContext).Subscription.Id
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: List
      position: Named
      isRequired: false
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    - name: Get
      position: Named
      isRequired: false
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  - name: WorkspaceName
    type: <xref href="System.String" data-throw-if-not-resolved="False" />
    description: |-
      The name of the workspace.
    defaultValue: None
    dontShow: false
    isDynamic: false
    parameterSets:
    - name: List
      position: Named
      isRequired: true
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    - name: Get
      position: Named
      isRequired: true
      valueFromPipeline: false
      valueFromPipelineByPropertyName: false
      valueFromRemainingArguments: false
    supportsWildcards: false
  commonParameters: |-
    This cmdlet supports the common parameters: -Debug, -ErrorAction, -ErrorVariable,
    -InformationAction, -InformationVariable, -OutBuffer, -OutVariable, -PipelineVariable,
    -ProgressAction, -Verbose, -WarningAction, and -WarningVariable. For more information, see
    [about_CommonParameters](https://go.microsoft.com/fwlink/?LinkID=113216).
syntaxes:
- syntax: |-
    ```Syntax
    Get-AzSentinelEntityQuery
        -ResourceGroupName <String>
        -WorkspaceName <String>
        [-SubscriptionId <String[]>]
        [-Kind <String>]
        [-DefaultProfile <PSObject>]
        [<CommonParameters>]
    ```
  parameterSetName: List
  isDefault: true
- syntax: |-
    ```Syntax
    Get-AzSentinelEntityQuery
        -Id <String>
        -ResourceGroupName <String>
        -WorkspaceName <String>
        [-SubscriptionId <String[]>]
        [-DefaultProfile <PSObject>]
        [<CommonParameters>]
    ```
  parameterSetName: Get
  isDefault: false
- syntax: |-
    ```Syntax
    Get-AzSentinelEntityQuery
        -InputObject <ISecurityInsightsIdentity>
        [-DefaultProfile <PSObject>]
        [<CommonParameters>]
    ```
  parameterSetName: GetViaIdentity
  isDefault: false
inputs:
- name: <xref href="Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.ISecurityInsightsIdentity" data-throw-if-not-resolved="False" />
outputs:
- name: <xref href="Microsoft.Azure.PowerShell.Cmdlets.SecurityInsights.Models.Api20210901Preview.IEntityQuery" data-throw-if-not-resolved="False" />
examples:
- title: 'Example 1: List all Entity Queries'
  description: |-
    ```powershell
    Get-AzSentinelEntityQuery -ResourceGroupName "myResourceGroupName" -workspaceName "myWorkspaceName"
    ```

    ```output
    DisplayName     : Related entities
    DataSource      : {SecurityAlert}
    Name            : 98b974fd-cc64-48b8-9bd0-3a209f5b944b
    InputEntityType : SecurityAlert

    DisplayName     : Related alerts
    DataSource      : {SecurityAlert}
    Name            : 055a5692-555f-42bd-ac17-923a5a9994ed
    InputEntityType : Host
    ```

    This command lists all Entity Queries under a Microsoft Sentinel workspace.
- title: 'Example 2: Get an Entity Query'
  description: |-
    ```powershell
    Get-AzSentinelEntityQuery -ResourceGroupName "myResourceGroupName" -workspaceName "myWorkspaceName" -Id "myEntityQueryId"
    ```

    ```output
    DisplayName     : Related entities
    DataSource      : {SecurityAlert}
    Name            : 98b974fd-cc64-48b8-9bd0-3a209f5b944b
    InputEntityType : SecurityAlert
    QueryTemplate   : let GetAlertRelatedEntities = (v_SecurityAlert_SystemAlertId:string){
                                                  SecurityAlert
                                                  | where SystemAlertId == v_SecurityAlert_SystemAlertId
                                                  | project entities = todynamic(Entities)
                                                  | mv-expand entities
                                                  | project-rename entity=entities};
                                                  GetAlertRelatedEntities('<systemAlertId>')
    ```

    This command gets an Entity Query.
- title: 'Example 3: Get an Entity Query by object Id'
  description: |-
    ```powershell
    $EntityQueries = Get-AzSentinelEntityQuery -ResourceGroupName "myResourceGroupName" -workspaceName "myWorkspaceName"
     $EntityQueries[0] | Get-AzSentinelEntityQuery
    ```

    ```output
    DisplayName     : Related entities
    DataSource      : {SecurityAlert}
    Name            : 98b974fd-cc64-48b8-9bd0-3a209f5b944b
    InputEntityType : SecurityAlert
    QueryTemplate   : let GetAlertRelatedEntities = (v_SecurityAlert_SystemAlertId:string){
                                                  SecurityAlert
                                                  | where SystemAlertId == v_SecurityAlert_SystemAlertId
                                                  | project entities = todynamic(Entities)
                                                  | mv-expand entities
                                                  | project-rename entity=entities};
                                                  GetAlertRelatedEntities('<systemAlertId>')
    ```

    This command gets a Entity Query by object.
metadata:
  content_git_url: https://github.com/Azure/azure-powershell/blob/main/src/SecurityInsights/SecurityInsights/help/Get-AzSentinelEntityQuery.md
  document type: cmdlet
  external help file: Az.SecurityInsights-help.xml
  HelpUri: https://learn.microsoft.com/powershell/module/az.securityinsights/get-azsentinelentityquery
  Module Name: Az.SecurityInsights
  original_content_git_url: https://github.com/Azure/azure-powershell/blob/main/src/SecurityInsights/SecurityInsights/help/Get-AzSentinelEntityQuery.md
  PlatyPS schema version: 2024-05-01
